app/controllers/applies_controller.rb

	def create
		@offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", nil]]