app/controllers/offers_controller.rb

SELECT  "offers".* FROM "offers" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "offers"
---
  def index
    @offers = Offer.paginate(:page => params[:page], :per_page => 30)

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @offer = Offer.find(params[:id])

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @offer = Offer.find(params[:id])

INSERT INTO "offers" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ok"], ["description", "ok"], ["user_id", 1], ["created_at", "2015-07-02 10:19:38.552131"], ["updated_at", "2015-07-02 10:19:38.552131"]]
---
  def create
    @offer = Offer.new(offer_params)
    @offer.user = current_user

    respond_to do |format|
      if @offer.save

UPDATE "offers" SET "description" = ?, "updated_at" = ? WHERE "offers"."id" = ?
---
  def update
    respond_to do |format|
      if @offer.update(offer_params)

DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 3]]
---
  def destroy
    @offer.destroy

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_offer
      @offer = Offer.find(params[:id])